//=======================================================================================
//                                                                                      =
//                         بِسْمِ ٱللّٰهِ ٱلرَّحْمٰنِ ٱلرَّحِيمِ                                             =
// "وَلَقَدْ خَلَقْنَا الْإِنْسَانَ وَنَعْلَمُ مَا تُوَسْوِسُ بِهِ نَفْسُهُ ۖ وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ الْوَرِيدِ" (Quran 50:16) -          =       
//                                                                                      =
//                                                                                      =
//-======================================================================================
#include <bits/stdc++.h>
using namespace std;
 
int main() {
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int cal[5];
    for (int i = 1; i <= 4; i++) {
        cin >> cal[i];
    }
    string s;
    cin >> s;
    long long total = 0;
    for (int i = 0; i < s.length(); i++) {
        int strip = s[i] - '0';
        total += cal[strip];
    }
    cout << total << endl;
    return 0;
}